ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DD32def.inc
; CLKCTRL_PLLCTRLA masks
.equ CLKCTRL_MULFAC_gm = 0x03            ; Multiplication factor group mask
.equ CLKCTRL_MULFAC_gp = 0               ; Multiplication factor group position
.equ CLKCTRL_MULFAC_0_bm = (1<<0)        ; Multiplication factor bit 0 mask
.equ CLKCTRL_MULFAC_0_bp = 0             ; Multiplication factor bit 0 position
.equ CLKCTRL_MULFAC_1_bm = (1<<1)        ; Multiplication factor bit 1 mask
.equ CLKCTRL_MULFAC_1_bp = 1             ; Multiplication factor bit 1 position
.equ CLKCTRL_SOURCE_bm = 0x40            ; Source bit mask
.equ CLKCTRL_SOURCE_bp = 6               ; Source bit position
; Masks for CLKCTRL_RUNSTDBY already defined

; CLKCTRL_OSC32KCTRLA masks
; Masks for CLKCTRL_RUNSTDBY already defined

; CLKCTRL_XOSC32KCTRLA masks
.equ CLKCTRL_ENABLE_bm = 0x01            ; Enable bit mask
.equ CLKCTRL_ENABLE_bp = 0               ; Enable bit position
.equ CLKCTRL_LPMODE_bm = 0x02            ; Low power mode bit mask
.equ CLKCTRL_LPMODE_bp = 1               ; Low power mode bit position
.equ CLKCTRL_SEL_bm = 0x04               ; Select bit mask
.equ CLKCTRL_SEL_bp = 2                  ; Select bit position
.equ CLKCTRL_CSUT_gm = 0x30              ; Crystal startup time group mask
.equ CLKCTRL_CSUT_gp = 4                 ; Crystal startup time group position
.equ CLKCTRL_CSUT_0_bm = (1<<4)          ; Crystal startup time bit 0 mask
.equ CLKCTRL_CSUT_0_bp = 4               ; Crystal startup time bit 0 position
.equ CLKCTRL_CSUT_1_bm = (1<<5)          ; Crystal startup time bit 1 mask
.equ CLKCTRL_CSUT_1_bp = 5               ; Crystal startup time bit 1 position
; Masks for CLKCTRL_RUNSTDBY already defined

; CLKCTRL_XOSCHFCTRLA masks
; Masks for CLKCTRL_ENABLE already defined
.equ CLKCTRL_SELHF_bm = 0x02             ; External Source Select bit mask
.equ CLKCTRL_SELHF_bp = 1                ; External Source Select bit position
.equ CLKCTRL_FRQRANGE_gm = 0x0C          ; Frequency Range group mask
.equ CLKCTRL_FRQRANGE_gp = 2             ; Frequency Range group position
.equ CLKCTRL_FRQRANGE_0_bm = (1<<2)      ; Frequency Range bit 0 mask
.equ CLKCTRL_FRQRANGE_0_bp = 2           ; Frequency Range bit 0 position
.equ CLKCTRL_FRQRANGE_1_bm = (1<<3)      ; Frequency Range bit 1 mask
.equ CLKCTRL_FRQRANGE_1_bp = 3           ; Frequency Range bit 1 position
.equ CLKCTRL_CSUTHF_gm = 0x30            ; Start-up Time Select group mask
.equ CLKCTRL_CSUTHF_gp = 4               ; Start-up Time Select group position
.equ CLKCTRL_CSUTHF_0_bm = (1<<4)        ; Start-up Time Select bit 0 mask
.equ CLKCTRL_CSUTHF_0_bp = 4             ; Start-up Time Select bit 0 position
.equ CLKCTRL_CSUTHF_1_bm = (1<<5)        ; Start-up Time Select bit 1 mask
.equ CLKCTRL_CSUTHF_1_bp = 5             ; Start-up Time Select bit 1 position
.equ CLKCTRL_RUNSTBY_bm = 0x80           ; Run Standby bit mask
.equ CLKCTRL_RUNSTBY_bp = 7              ; Run Standby bit position

; Clock select
.equ CLKCTRL_CLKSEL_OSCHF_gc = (0x00<<0) ; Internal high-frequency oscillator
.equ CLKCTRL_CLKSEL_OSC32K_gc = (0x01<<0) ; Internal 32.768 kHz oscillator
.equ CLKCTRL_CLKSEL_XOSC32K_gc = (0x02<<0) ; 32.768 kHz crystal oscillator
.equ CLKCTRL_CLKSEL_EXTCLK_gc = (0x03<<0) ; External clock

; Prescaler division select
.equ CLKCTRL_PDIV_2X_gc = (0x00<<1)      ; 2X
.equ CLKCTRL_PDIV_4X_gc = (0x01<<1)      ; 4X
.equ CLKCTRL_PDIV_8X_gc = (0x02<<1)      ; 8X
.equ CLKCTRL_PDIV_16X_gc = (0x03<<1)     ; 16X
.equ CLKCTRL_PDIV_32X_gc = (0x04<<1)     ; 32X
.equ CLKCTRL_PDIV_64X_gc = (0x05<<1)     ; 64X
.equ CLKCTRL_PDIV_6X_gc = (0x08<<1)      ; 6X
.equ CLKCTRL_PDIV_10X_gc = (0x09<<1)     ; 10X
.equ CLKCTRL_PDIV_12X_gc = (0x0A<<1)     ; 12X
.equ CLKCTRL_PDIV_24X_gc = (0x0B<<1)     ; 24X
.equ CLKCTRL_PDIV_48X_gc = (0x0C<<1)     ; 48X

; Clock Failure Detect Source select
.equ CLKCTRL_CFDSRC_CLKMAIN_gc = (0x00<<2) ; Main Clock
.equ CLKCTRL_CFDSRC_XOSCHF_gc = (0x01<<2) ; XOSCHF
.equ CLKCTRL_CFDSRC_XOSC32K_gc = (0x02<<2) ; XOSC32K

; Interrupt type select
.equ CLKCTRL_INTTYPE_INT_gc = (0x00<<7)  ; Regular Interrupt
.equ CLKCTRL_INTTYPE_NMI_gc = (0x01<<7)  ; NMI

; Frequency select
.equ CLKCTRL_FRQSEL_1M_gc = (0x00<<2)    ; 1 MHz system clock
.equ CLKCTRL_FRQSEL_2M_gc = (0x01<<2)    ; 2 MHz system clock
.equ CLKCTRL_FRQSEL_3M_gc = (0x02<<2)    ; 3 MHz system clock
.equ CLKCTRL_FRQSEL_4M_gc = (0x03<<2)    ; 4 MHz system clock (default)
.equ CLKCTRL_FRQSEL_8M_gc = (0x05<<2)    ; 8 MHz system clock
.equ CLKCTRL_FRQSEL_12M_gc = (0x06<<2)   ; 12 MHz system clock
.equ CLKCTRL_FRQSEL_16M_gc = (0x07<<2)   ; 16 MHz system clock
.equ CLKCTRL_FRQSEL_20M_gc = (0x08<<2)   ; 20 MHz system clock
.equ CLKCTRL_FRQSEL_24M_gc = (0x09<<2)   ; 24 MHz system clock

; Multiplication factor select
.equ CLKCTRL_MULFAC_DISABLE_gc = (0x00<<0) ; PLL is disabled
.equ CLKCTRL_MULFAC_2x_gc = (0x01<<0)    ; 2 x multiplication factor
.equ CLKCTRL_MULFAC_3x_gc = (0x02<<0)    ; 3 x multiplication factor

; Source select
.equ CLKCTRL_SOURCE_OSCHF_gc = (0x00<<6) ; High frequency internal oscillator as PLL source
.equ CLKCTRL_SOURCE_XOSCHF_gc = (0x01<<6) ; High frequency external clock or external high frequency oscillator as PLL source

; Start-up Time Select
.equ CLKCTRL_CSUTHF_256_gc = (0x00<<4)   ; 256 XOSCHF cycles
.equ CLKCTRL_CSUTHF_1K_gc = (0x01<<4)    ; 1K XOSCHF cycles
.equ CLKCTRL_CSUTHF_4K_gc = (0x02<<4)    ; 4K XOSCHF cycles

; Frequency Range select
.equ CLKCTRL_FRQRANGE_8M_gc = (0x00<<2)  ; Max 8 MHz XTAL Frequency
.equ CLKCTRL_FRQRANGE_16M_gc = (0x01<<2) ; Max 16 MHz XTAL Frequency
.equ CLKCTRL_FRQRANGE_24M_gc = (0x02<<2) ; Max 24 MHz XTAL Frequency
.equ CLKCTRL_FRQRANGE_32M_gc = (0x03<<2) ; Max 32 MHz XTAL Frequency

; External Source Select
.equ CLKCTRL_SELHF_XTAL_gc = (0x00<<1)   ; External Crystal
.equ CLKCTRL_SELHF_EXTCLOCK_gc = (0x01<<1) ; External clock on XTALHF1 pin

; Crystal startup time select
.equ CLKCTRL_CSUT_1K_gc = (0x00<<4)      ; 1k cycles
.equ CLKCTRL_CSUT_16K_gc = (0x01<<4)     ; 16k cycles
.equ CLKCTRL_CSUT_32K_gc = (0x02<<4)     ; 32k cycles
.equ CLKCTRL_CSUT_64K_gc = (0x03<<4)     ; 64k cycles


;*************************************************************************
;** CPU - CPU
;*************************************************************************

; CPU_CCP masks
.equ CPU_CCP_gm = 0xFF                   ; CCP signature group mask
.equ CPU_CCP_gp = 0                      ; CCP signature group position
.equ CPU_CCP_0_bm = (1<<0)               ; CCP signature bit 0 mask
.equ CPU_CCP_0_bp = 0                    ; CCP signature bit 0 position
.equ CPU_CCP_1_bm = (1<<1)               ; CCP signature bit 1 mask
.equ CPU_CCP_1_bp = 1                    ; CCP signature bit 1 position
.equ CPU_CCP_2_bm = (1<<2)               ; CCP signature bit 2 mask
.equ CPU_CCP_2_bp = 2                    ; CCP signature bit 2 position
.equ CPU_CCP_3_bm = (1<<3)               ; CCP signature bit 3 mask
.equ CPU_CCP_3_bp = 3                    ; CCP signature bit 3 position
.equ CPU_CCP_4_bm = (1<<4)               ; CCP signature bit 4 mask
.equ CPU_CCP_4_bp = 4                    ; CCP signature bit 4 position
.equ CPU_CCP_5_bm = (1<<5)               ; CCP signature bit 5 mask
.equ CPU_CCP_5_bp = 5                    ; CCP signature bit 5 position
.equ CPU_CCP_6_bm = (1<<6)               ; CCP signature bit 6 mask
.equ CPU_CCP_6_bp = 6                    ; CCP signature bit 6 position
.equ CPU_CCP_7_bm = (1<<7)               ; CCP signature bit 7 mask
.equ CPU_CCP_7_bp = 7                    ; CCP signature bit 7 position

; CPU_SREG masks
.equ CPU_C_bm = 0x01                     ; Carry Flag bit mask
.equ CPU_C_bp = 0                        ; Carry Flag bit position
.equ CPU_Z_bm = 0x02                     ; Zero Flag bit mask
.equ CPU_Z_bp = 1                        ; Zero Flag bit position
.equ CPU_N_bm = 0x04                     ; Negative Flag bit mask
.equ CPU_N_bp = 2                        ; Negative Flag bit position
.equ CPU_V_bm = 0x08                     ; Two's Complement Overflow Flag bit mask
.equ CPU_V_bp = 3                        ; Two's Complement Overflow Flag bit position
.equ CPU_S_bm = 0x10                     ; N Exclusive Or V Flag bit mask
.equ CPU_S_bp = 4                        ; N Exclusive Or V Flag bit position
.equ CPU_H_bm = 0x20                     ; Half Carry Flag bit mask
.equ CPU_H_bp = 5                        ; Half Carry Flag bit position
.equ CPU_T_bm = 0x40                     ; Transfer Bit bit mask
.equ CPU_T_bp = 6                        ; Transfer Bit bit position
.equ CPU_I_bm = 0x80                     ; Global Interrupt Enable Flag bit mask
.equ CPU_I_bp = 7                        ; Global Interrupt Enable Flag bit position

