ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DD32def.inc
; VREF_ACREF masks
; Masks for VREF_REFSEL already defined
; Masks for VREF_ALWAYSON already defined

; Reference select
.equ VREF_REFSEL_1V024_gc = (0x00<<0)    ; Internal 1.024V reference
.equ VREF_REFSEL_2V048_gc = (0x01<<0)    ; Internal 2.048V reference
.equ VREF_REFSEL_4V096_gc = (0x02<<0)    ; Internal 4.096V reference
.equ VREF_REFSEL_2V500_gc = (0x03<<0)    ; Internal 2.500V reference
.equ VREF_REFSEL_VDD_gc = (0x05<<0)      ; VDD as reference
.equ VREF_REFSEL_VREFA_gc = (0x06<<0)    ; External reference on VREFA pin


;*************************************************************************
;** WDT - Watch-Dog Timer
;*************************************************************************

; WDT_CTRLA masks
.equ WDT_PERIOD_gm = 0x0F                ; Period group mask
.equ WDT_PERIOD_gp = 0                   ; Period group position
.equ WDT_PERIOD_0_bm = (1<<0)            ; Period bit 0 mask
.equ WDT_PERIOD_0_bp = 0                 ; Period bit 0 position
.equ WDT_PERIOD_1_bm = (1<<1)            ; Period bit 1 mask
.equ WDT_PERIOD_1_bp = 1                 ; Period bit 1 position
.equ WDT_PERIOD_2_bm = (1<<2)            ; Period bit 2 mask
.equ WDT_PERIOD_2_bp = 2                 ; Period bit 2 position
.equ WDT_PERIOD_3_bm = (1<<3)            ; Period bit 3 mask
.equ WDT_PERIOD_3_bp = 3                 ; Period bit 3 position
.equ WDT_WINDOW_gm = 0xF0                ; Window group mask
.equ WDT_WINDOW_gp = 4                   ; Window group position
.equ WDT_WINDOW_0_bm = (1<<4)            ; Window bit 0 mask
.equ WDT_WINDOW_0_bp = 4                 ; Window bit 0 position
.equ WDT_WINDOW_1_bm = (1<<5)            ; Window bit 1 mask
.equ WDT_WINDOW_1_bp = 5                 ; Window bit 1 position
.equ WDT_WINDOW_2_bm = (1<<6)            ; Window bit 2 mask
.equ WDT_WINDOW_2_bp = 6                 ; Window bit 2 position
.equ WDT_WINDOW_3_bm = (1<<7)            ; Window bit 3 mask
.equ WDT_WINDOW_3_bp = 7                 ; Window bit 3 position

; WDT_STATUS masks
.equ WDT_SYNCBUSY_bm = 0x01              ; Syncronization busy bit mask
.equ WDT_SYNCBUSY_bp = 0                 ; Syncronization busy bit position
.equ WDT_LOCK_bm = 0x80                  ; Lock enable bit mask
.equ WDT_LOCK_bp = 7                     ; Lock enable bit position

; Period select
.equ WDT_PERIOD_OFF_gc = (0x00<<0)       ; Off
.equ WDT_PERIOD_8CLK_gc = (0x01<<0)      ; 8 cycles (8ms)
.equ WDT_PERIOD_16CLK_gc = (0x02<<0)     ; 16 cycles (16ms)
.equ WDT_PERIOD_32CLK_gc = (0x03<<0)     ; 32 cycles (32ms)
.equ WDT_PERIOD_64CLK_gc = (0x04<<0)     ; 64 cycles (64ms)
.equ WDT_PERIOD_128CLK_gc = (0x05<<0)    ; 128 cycles (0.128s)
.equ WDT_PERIOD_256CLK_gc = (0x06<<0)    ; 256 cycles (0.256s)
.equ WDT_PERIOD_512CLK_gc = (0x07<<0)    ; 512 cycles (0.512s)
.equ WDT_PERIOD_1KCLK_gc = (0x08<<0)     ; 1K cycles (1.0s)
.equ WDT_PERIOD_2KCLK_gc = (0x09<<0)     ; 2K cycles (2.0s)
.equ WDT_PERIOD_4KCLK_gc = (0x0A<<0)     ; 4K cycles (4.1s)
.equ WDT_PERIOD_8KCLK_gc = (0x0B<<0)     ; 8K cycles (8.2s)

; Window select
.equ WDT_WINDOW_OFF_gc = (0x00<<4)       ; Off
.equ WDT_WINDOW_8CLK_gc = (0x01<<4)      ; 8 cycles (8ms)
.equ WDT_WINDOW_16CLK_gc = (0x02<<4)     ; 16 cycles (16ms)
.equ WDT_WINDOW_32CLK_gc = (0x03<<4)     ; 32 cycles (32ms)
.equ WDT_WINDOW_64CLK_gc = (0x04<<4)     ; 64 cycles (64ms)
.equ WDT_WINDOW_128CLK_gc = (0x05<<4)    ; 128 cycles (0.128s)
.equ WDT_WINDOW_256CLK_gc = (0x06<<4)    ; 256 cycles (0.256s)
.equ WDT_WINDOW_512CLK_gc = (0x07<<4)    ; 512 cycles (0.512s)
.equ WDT_WINDOW_1KCLK_gc = (0x08<<4)     ; 1K cycles (1.0s)
.equ WDT_WINDOW_2KCLK_gc = (0x09<<4)     ; 2K cycles (2.0s)
.equ WDT_WINDOW_4KCLK_gc = (0x0A<<4)     ; 4K cycles (4.1s)
.equ WDT_WINDOW_8KCLK_gc = (0x0B<<4)     ; 8K cycles (8.2s)


;*************************************************************************
;** ZCD - Zero Cross Detect
;*************************************************************************

; ZCD_CTRLA masks
.equ ZCD_ENABLE_bm = 0x01                ; Enable bit mask
.equ ZCD_ENABLE_bp = 0                   ; Enable bit position
.equ ZCD_INVERT_bm = 0x08                ; Invert signal from pin bit mask
.equ ZCD_INVERT_bp = 3                   ; Invert signal from pin bit position
.equ ZCD_OUTEN_bm = 0x40                 ; Output Pad Enable bit mask
.equ ZCD_OUTEN_bp = 6                    ; Output Pad Enable bit position
.equ ZCD_RUNSTDBY_bm = 0x80              ; Run in Standby Mode bit mask
.equ ZCD_RUNSTDBY_bp = 7                 ; Run in Standby Mode bit position

; ZCD_INTCTRL masks
.equ ZCD_INTMODE_gm = 0x03               ; Interrupt Mode group mask
.equ ZCD_INTMODE_gp = 0                  ; Interrupt Mode group position
.equ ZCD_INTMODE_0_bm = (1<<0)           ; Interrupt Mode bit 0 mask
.equ ZCD_INTMODE_0_bp = 0                ; Interrupt Mode bit 0 position
.equ ZCD_INTMODE_1_bm = (1<<1)           ; Interrupt Mode bit 1 mask
.equ ZCD_INTMODE_1_bp = 1                ; Interrupt Mode bit 1 position

; ZCD_STATUS masks
.equ ZCD_CROSSIF_bm = 0x01               ; ZCD Interrupt Flag bit mask
.equ ZCD_CROSSIF_bp = 0                  ; ZCD Interrupt Flag bit position
.equ ZCD_STATE_bm = 0x10                 ; ZCD State bit mask
.equ ZCD_STATE_bp = 4                    ; ZCD State bit position

; Interrupt Mode select
.equ ZCD_INTMODE_NONE_gc = (0x00<<0)     ; No interrupt
.equ ZCD_INTMODE_RISING_gc = (0x01<<0)   ; Interrupt on rising input signal
.equ ZCD_INTMODE_FALLING_gc = (0x02<<0)  ; Interrupt on falling input signal
.equ ZCD_INTMODE_BOTH_gc = (0x03<<0)     ; Interrupt on both rising and falling input signal

; ZCD State select
.equ ZCD_STATE_LOW_gc = (0x00<<4)        ; Output is 0
.equ ZCD_STATE_HIGH_gc = (0x01<<4)       ; Output is 1




; ***** CPU REGISTER DEFINITIONS *****************************************
.def	XH	= r27
.def	XL	= r26
.def	YH	= r29
.def	YL	= r28
.def	ZH	= r31
.def	ZL	= r30


; ***** DATA MEMORY DECLARATIONS *****************************************


#define DATAMEM_START 0x0000
#define DATAMEM_SIZE 0x10000
#define DATAMEM_END (0x0000 + 0x10000 - 1)

#define IO_START 0x0000
#define IO_SIZE 0x103F
#define IO_END (0x0000 + 0x103F - 1)

